app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Kvothe"], ["email", "kevin9075@gmail.com"], ["password", "1234"], ["created_at", "2015-06-23 19:58:37.514797"], ["updated_at", "2015-06-23 19:58:37.514797"]]
---
	def create
		# @user = User.new(username: params[:username], email: params[:email],
		# 	password: params[:password])
		@user = User.new(user_params)
		if @user.save